Revit 2024 API
FieldDomainPointsByUV Constructor (IList<UV>)
 Creates object from an array of two-dimensional point coordinates
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FieldDomainPointsByUV(
	IList<UV> points
)
Visual Basic
Public Sub New ( _
	points As IList(Of UV) _
)
Visual C++
public:
FieldDomainPointsByUV(
	IList<UV^>^ points
)
Parameters
points
Type: System.Collections.Generic.IList<UV>
 Array of two-dimensional point coordinates representing domain points (usually on surface)
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FieldDomainPointsByUV Class
FieldDomainPointsByUV Overload
Autodesk.Revit.DB.Analysis Namespace